int123123/Jackett/esp32-ld2450-cam/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32"

# WiFi (these map to project Kconfig)
CONFIG_WIFI_SSID="YOUR_SSID"
CONFIG_WIFI_PASSWORD="YOUR_PASSWORD"

# PSRAM
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_SUPPORT=y
CONFIG_ESP32_SPIRAM_BOOT_INIT=y
CONFIG_ESP32_DEFAULT_PSRAM_CLK_IO=17
CONFIG_ESP32_DEFAULT_PSRAM_CS_IO=16

# MQTT
CONFIG_MQTT_PROTOCOL_311=y

# Logging
CONFIG_LOG_COLORS=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Camera
CONFIG_CAMERA_WARMUP_MS=500
CONFIG_PERSON_MIN_SKIN_RATIO_PERCENT=1
CONFIG_CAMERA_FRAMESIZE_QQVGA=y

# Controller
CONFIG_DELAY_AFTER_NO_PERSON_MS=2000
CONFIG_MIN_CAMERA_HOLD_MS=1500
CONFIG_PERSON_CONFIRM_FRAMES=2
CONFIG_PERSON_LOST_FRAMES=3

# LD2450
CONFIG_LD2450_METHOD_UART=y
CONFIG_LD2450_UART_NUM=2
CONFIG_LD2450_UART_TX=14
CONFIG_LD2450_UART_RX=15
CONFIG_LD2450_UART_BAUD=115200
CONFIG_LD2450_POWER_GPIO=-1
